Revit 2024 API
ConnectionInputPointInfo Constructor
 Construct a default input point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ConnectionInputPointInfo()
Visual Basic
Public Sub New
Visual C++
public:
ConnectionInputPointInfo()
See Also
ConnectionInputPointInfo Class
ConnectionInputPointInfo Overload
Autodesk.Revit.DB.Structure Namespace